---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PatternMirrorForDivisionRule
source: html/4b2c9f6a-e57d-da50-0782-47ecfa9d678f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PatternMirrorForDivisionRule Property

"Mirror"

## Syntax (C#)
```csharp
public static ForgeTypeId PatternMirrorForDivisionRule { get; }
```